---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CircularRefsForInstParams
source: html/e4ce657d-2861-3078-d1c7-09e01b399039.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CircularRefsForInstParams Property

"Instance parameter '%1!s!' generates circular references."

## Syntax (C#)
```csharp
public static FailureDefinitionId CircularRefsForInstParams { get; }
```